app/Models/ReportsModel.php

SELECT *
FROM `tbloffice`
WHERE `officeid` = 'all'
---
    public function get_office_name($params)
    {
        $query = $this->db->table('tbloffice')->where('officeid', $params['officeid'])->get();
        return $query->getRowArray();

SELECT `sera`.`servicesid`, `sera`.`name`, `sera`.`unit`, GROUP_CONCAT( DISTINCT sqd.suggestions SEPARATOR ";;") AS aggregated_suggestions
FROM `tblservices` `sera`
INNER JOIN `tblcss_summary` `csssum` ON `csssum`.`servicesid` = `sera`.`servicesid`
INNER JOIN `tblcss_details_sqd` `sqd` ON `sqd`.`csssummaryid` = `csssum`.`csssummaryid`
INNER JOIN `tblquarters` `qua` ON `qua`.`quarterid` = `csssum`.`quarterid`
WHERE `sqd`.`suggestions` != ''
AND `csssum`.`year` = '2025'
GROUP BY `sera`.`servicesid`
---
     public function gen_comments($params){
        $builder = $this->db->table('tblservices sera');
        $builder->select('sera.servicesid, sera.name, sera.unit, GROUP_CONCAT( DISTINCT sqd.suggestions SEPARATOR ";;") AS aggregated_suggestions');
        $builder->join('tblcss_summary csssum', 'csssum.servicesid = sera.servicesid', 'inner');
        $builder->join('tblcss_details_sqd sqd', 'sqd.csssummaryid = csssum.csssummaryid', 'inner');
        $builder->join('tblquarters qua', 'qua.quarterid = csssum.quarterid', 'inner');
        $builder->where('sqd.suggestions !=', '');
        $builder->where('csssum.year', $params['year']);

        // Add conditions based on parameters
        if ($params['typeselector'] === 'semester' && $params['semesterid'] != 'all') {
            $builder->where('qua.semesterid', $params['semesterid']);
        }
        if ($params['typeselector'] === 'quarter') {
            $builder->where('csssum.quarterid', $params['quarterid']);
        }
        if ($params['officeid'] != 'all') {
            $builder->where('csssum.officeid', $params['officeid']);
        }

        $builder->groupBy('sera.servicesid');

        $query = $builder->get();